Repository: bornmt-dev/idecor-wordpress
Catalog: plugins/ws-action-scheduler-cleaner/languages/ws-action-scheduler-cleaner-*_formal.po
Languages: de

source: This tool allows you to clean up the Action Scheduler tables in your WordPress database. Action Scheduler is a library used by many plugins to schedule background tasks.
de: Dieses Tool ermöglicht es Ihnen, die Action Scheduler-Tabellen in Ihrer WordPress-Datenbank zu bereinigen. Action Scheduler ist eine Bibliothek, die von vielen Plugins zur Planung von Hintergrundaufgaben verwendet wird.

source: Please wait...
de: Bitte warten Sie...

source: Loading...
de: Wird geladen...

source: The Action Scheduler uses two main tables:
de: Der Action Scheduler verwendet zwei Haupttabellen:

source: Actions Table: Stores scheduled actions and their statuses.
de: Aktionstabelle: Speichert geplante Aktionen und deren Status.

source: Logs Table: Stores logs of action executions.
de: Protokolltabelle: Speichert Protokolle von Aktionsausführungen.

source: Clearing these tables is generally safe and can improve database performance. However, please note:
de: Das Bereinigen dieser Tabellen ist im Allgemeinen sicher und kann die Datenbankleistung verbessern. Bitte beachten Sie jedoch:

source: Clearing can take a while depending on the size of the tables.
de: Die Bereinigung kann je nach Größe der Tabellen eine Weile dauern.

source: Cleared data will be permanently deleted.
de: Bereinigte Daten werden dauerhaft gelöscht.

source: It's recommended to <strong>make a backup</strong> before proceeding.
de: Es wird empfohlen, vor dem Fortfahren ein <strong>Backup zu erstellen</strong>.

source: Clearing completed, failed, or canceled actions usually doesn't affect WordPress functionality.
de: Das Bereinigen von abgeschlossenen, fehlgeschlagenen oder abgebrochenen Aktionen beeinträchtigt normalerweise nicht die WordPress-Funktionalität.

source: For more information, visit the <a href="%s">Action Scheduler admin page</a>.
de: Weitere Informationen finden Sie auf der <a href="%s">Action Scheduler-Administrationsseite</a>.

source: Current Table Sizes:
de: Aktuelle Tabellengrößen:

source: Actions table:
de: Aktionstabelle:

source: rows
de: Zeilen

source: Logs table:
de: Protokolltabelle:

source: Clear Action Statuses
de: Aktionsstatus bereinigen

source: Select which action statuses to clear:
de: Wählen Sie aus, welche Aktionsstatus bereinigt werden sollen:

source: Complete
de: Abgeschlossen

source: Failed
de: Fehlgeschlagen

source: Canceled
de: Abgebrochen

source: Clear Selected Actions
de: Ausgewählte Aktionen bereinigen

source: Clear Logs Table
de: Protokolltabelle bereinigen

source: This will clear all entries in the logs table.
de: Dies wird alle Einträge in der Protokolltabelle löschen.

source: Clear Logs
de: Protokolle bereinigen

source: Scheduling Options
de: Planungsoptionen

source: Set up automatic clearing schedules for selected statuses (set to 0 to clean fully; leave empty to disable automatic clearing):
de: Richten Sie automatische Bereinigungspläne für ausgewählte Status ein (auf 0 setzen, um vollständig zu bereinigen; leer lassen, um die automatische Bereinigung zu deaktivieren):

source: Clear logs older than:
de: Protokolle bereinigen, die älter sind als:

source: days
de: Tage

source: Clear action statuses older than:
de: Aktionsstatus bereinigen, die älter sind als:

source: Save Schedule
de: Zeitplan speichern

source: Selected actions cleared successfully!
de: Ausgewählte Aktionen erfolgreich bereinigt!

source: Logs cleared successfully!
de: Protokolle erfolgreich bereinigt!

source: Schedule saved successfully!
de: Zeitplan erfolgreich gespeichert!

source: Statuses saved successfully!
de: Status erfolgreich gespeichert!

source: Settings
de: Einstellungen

source: Action Scheduler tables do not exist. Please ensure Action Scheduler is properly installed and activated.
de: Die Action-Scheduler-Tabellen existieren nicht. Bitte stellen Sie sicher, dass Action Scheduler ordnungsgemäß installiert und aktiviert ist.

source: Please select at least one status to clear.
de: Bitte wählen Sie mindestens einen Status zum Bereinigen aus.

source: Clearing in progress...
de: Bereinigung läuft...

source: An error occurred. Please try again.
de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es erneut.

source: Optimize Tables
de: Tabellen optimieren

source: Optimize the database tables to reclaim unused space and potentially improve performance.
de: Optimiere die Datenbanktabellen, um ungenutzten Speicherplatz freizugeben und möglicherweise die Leistung zu verbessern.

source: Optimize Actions Table
de: Aktionstabelle optimieren

source: Optimize Logs Table
de: Protokolltabelle optimieren

source: Optimizing table...
de: Tabelle wird optimiert...

source: %s table optimized successfully!
de: %s-Tabelle erfolgreich optimiert!

source: Table optimization failed.
de: Tabellenoptimierung fehlgeschlagen.

source: Table does not exist.
de: Tabelle existiert nicht.

source: Invalid table type.
de: Ungültiger Tabellentyp.

source: Insufficient permissions.
de: Unzureichende Berechtigungen.

source: Setting the "Cleanup Schedule" will activate the plugin's own cleaning system, a high-throughput system with moderate server resource usage best suited for less busy times of the day. The "Retention Period" for actions cleanup affects both the plugin's and Action Scheduler's cleanup systems. Action Scheduler's own retention period only concerns the actions table and runs continuously in the background with low server resource usage. The "Retention Period" for logs cleanup only affects the plugin's cleanup system, as Action Scheduler does not have its own mechanism for cleaning logs.
de: Das Setzen des "Bereinigungszeitplans" aktiviert das eigene Bereinigungssystem des Plugins, ein System mit hohem Durchsatz und moderatem Serverressourcenverbrauch, das am besten für weniger ausgelastete Tageszeiten geeignet ist. Die "Aufbewahrungsfrist" für die Bereinigung von Aktionen wirkt sich sowohl auf das Plugin- als auch auf das Action Scheduler-Bereinigungssystem aus. Die eigene Aufbewahrungsfrist von Action Scheduler betrifft nur die Aktionstabelle und läuft kontinuierlich im Hintergrund mit geringem Serverressourcenverbrauch. Die "Aufbewahrungsfrist" für die Bereinigung von Protokollen wirkt sich nur auf das Bereinigungssystem des Plugins aus, da Action Scheduler keinen eigenen Mechanismus zur Bereinigung von Protokollen hat.

source: Action Statuses
de: Aktionsstatus

source: Cleanup Schedule:
de: Bereinigungszeitplan:

source: How often to run cleanup (empty or 0 = disabled, 1-365 days).
de: Wie oft die Bereinigung ausgeführt werden soll (leer oder 0 = deaktiviert, 1-365 Tage).

source: Schedule Time:
de: Zeitplan:

source: Time of day to run cleanup (uses WordPress timezone).
de: Tageszeit für die Bereinigung (verwendet WordPress-Zeitzone).

source: Retention Period:
de: Aufbewahrungsfrist:

source: Delete action statuses older than this (0 = delete all matching statuses, required field).
de: Aktionsstatus löschen, die älter sind als dies (0 = alle passenden Status löschen, Pflichtfeld).

source: Logs
de: Protokolle

source: Delete logs older than this (0 = delete all logs, required field).
de: Protokolle löschen, die älter sind als dies (0 = alle Protokolle löschen, Pflichtfeld).

source: Actions schedule interval must be empty or between 1 and 365 days.
de: Das Intervall für den Aktionszeitplan muss leer sein oder zwischen 1 und 365 Tagen liegen.

source: Logs schedule interval must be empty or between 1 and 365 days.
de: Das Intervall für den Protokollzeitplan muss leer sein oder zwischen 1 und 365 Tagen liegen.

source: Actions schedule time must be in HH:MM format.
de: Die Zeit für den Aktionszeitplan muss im Format HH:MM angegeben werden.

source: Logs schedule time must be in HH:MM format.
de: Die Zeit für den Protokollzeitplan muss im Format HH:MM angegeben werden.

source: Actions retention period is required and must be between 0 and 365 days.
de: Die Aufbewahrungsfrist für Aktionen ist erforderlich und muss zwischen 0 und 365 Tagen liegen.

source: Logs retention period is required and must be between 0 and 365 days.
de: Die Aufbewahrungsfrist für Protokolle ist erforderlich und muss zwischen 0 und 365 Tagen liegen.
